// BSLLS:MissingVariablesDescription-off

Перем Журнал;

&Перед("Оплатить")
Процедура ПередОплатой(Сумма) Экспорт
	Журнал.Записать("Дополнение.Перед " + Сумма);
КонецПроцедуры

&После("Оплатить")
Процедура ПослеОплаты(Сумма) Экспорт
	Журнал.Записать("Дополнение.После " + Сумма);
КонецПроцедуры

&После("Валюта")
Процедура ПослеВалюты(Результат) Экспорт
	Результат = Результат + " (дополнено)";
КонецПроцедуры

&Расширение("Касса")
Процедура ПриСозданииОбъекта(&Пластилин ЖурналВызовов)
	Журнал = ЖурналВызовов;
КонецПроцедуры
