// BSLLS:MissingVariablesDescription-off

Перем Журнал;

Функция Сложить(А, Б) Экспорт
	Журнал.Записать(СтрШаблон("Калькулятор.Сложить %1 %2", А, Б));
	Возврат А + Б;
КонецФункции

Функция Умножить(А, Б = 10) Экспорт
	Возврат А * Б;
КонецФункции

Процедура Записать(Значение) Экспорт
	Журнал.Записать("Калькулятор.Записать " + Значение);
КонецПроцедуры

Процедура Нормализовать(Значение) Экспорт
	Значение = СокрЛП(Значение);
КонецПроцедуры

&Желудь
Процедура ПриСозданииОбъекта(&Пластилин ЖурналВызовов)
	Журнал = ЖурналВызовов;
КонецПроцедуры
