#Использовать "../internal"

Перем _ИмяМетода;

// Имя перехватываемого метода расширяемого желудя.
//
//  Возвращаемое значение:
//   Строка
//
Функция ИмяМетода() Экспорт
	Возврат _ИмяМетода;
КонецФункции

// Метод расширения выполняется после метода расширяемого желудя - как `&После` в расширениях 1С.
//
// Метод расширения - экспортная процедура с теми же параметрами, что у перехватываемого метода.
// Если перехватываемый метод - функция, у процедуры может быть ещё один, последний параметр:
// в него передаётся результат функции. Параметр передаётся по ссылке, присвоенное ему
// значение станет результатом.
//
// Если перехватываемый метод выбросил исключение, метод расширения не выполняется.
//
// Размещается над экспортным методом класса с аннотацией `&Расширение`.
//
// Параметры:
//   Значение - Строка - Имя перехватываемого метода.
//
// Пример:
// &После("Посчитать")
// Процедура ПослеПосчитать(А, Б, Результат) Экспорт
// 	Результат = Окр(Результат, 2);
// КонецПроцедуры
//
&Аннотация("После")
Процедура ПриСозданииОбъекта(Значение)
	_ИмяМетода = РасширенияЖелудейСлужебный.ИмяПерехватываемогоМетода(Значение, "После");
КонецПроцедуры
