#Использовать "../internal"

Перем _ИмяМетода;

// Имя перехватываемого метода расширяемого желудя.
//
//  Возвращаемое значение:
//   Строка
//
Функция ИмяМетода() Экспорт
	Возврат _ИмяМетода;
КонецФункции

// Метод расширения выполняется перед методом расширяемого желудя - как `&Перед` в расширениях 1С.
//
// Метод расширения - экспортная процедура с теми же параметрами, что у перехватываемого метода.
// Параметры передаются по ссылке: присвоенное им значение получит перехватываемый метод.
//
// Размещается над экспортным методом класса с аннотацией `&Расширение`.
//
// Параметры:
//   Значение - Строка - Имя перехватываемого метода.
//
// Пример:
// &Перед("Записать")
// Процедура ПередЗаписью(Данные) Экспорт
// КонецПроцедуры
//
&Аннотация("Перед")
Процедура ПриСозданииОбъекта(Значение)
	_ИмяМетода = РасширенияЖелудейСлужебный.ИмяПерехватываемогоМетода(Значение, "Перед");
КонецПроцедуры
